{"comments": ["完美诠释了纸上谈兵的最高境界", "我焯，堑壕战是吧", "这是什么AI配音的", "怀念联通曾经天下无敌的火长矛，不管什么兵都是直接冲锋炸死[大哭]", "额……一开始远程兵上墙的话是不是就不会有对面这么多波反推了？", "万里长城永不倒", "联通牛逼[滑稽]", "“你以为我是谁，把城墙给我修过去！”[doge]", "元神，启动", "明朝的科技，宋朝的经济，元朝的军事，这是什么三合一文明啊？", "最后打成战壕战", "18:42燃起来啦[打call][打call][打call]", "让我想起来泽拉图说的：“我们的战士，由荣耀和传承联系在一起！”中华民族代代相传而薪火不绝，靠的就是历史的传承绵延不断，就像长城一样[支持]", "最精彩的一集", "老乌龟之战[脱单doge]", "有一说一元朝确实能出门和各国热情结交", "帝国时代四经常打成这种添油战", "看萝卜玩帝国四，我也买帝国四\n还看什么攻略，我直接不管开始匹配\n《真男人就要神罗大剑》\n《这村民怎么拦不住冲车》\n《卸载游戏》\n《学成归来》\n《电竞小天才怎可能打不过中等人机》\n《日不落的强大圈地经济》\n《怎么人机也出投石车》\n《游戏是给对社会没贡献的人玩的》", "其实英格兰城堡网络很早就只有15%（升级30%）效果了，这个文本直到现在还没改……不过也比法兰西那个到现在都没改的骑兵加20%移速（实际效果是训练速度加快20%）的文本好。", "萝卜里在干什么？快一个月没更新了我缺的营养这块谁给我补？", "哥，你更新吧，我错了，我不该说你更的慢的，哥，你更新了吧，我一定给你三连，就更新一下吧[大哭][大哭][大哭]", "催更！", "woc，终于刷到黑萝卜了，攒了一波大的", "催更", "催更！", "催更！", "星际还不更吗？", "在？dlc新出的6个文明练的怎么样了[脱单doge]\n“日文”这个文明很狗的样子，感觉这六个除了拜占庭和贞德，名字取的都有点随意", "打出二战的感觉了，操。", "更新呢？", "为啥看得我热血沸腾", "厉害", "你有点太城市化了[脱单doge]", "怎么还不更新，气孕了", "更新啊", "现在是11月21，怎么还没更新[大哭]", "触发副本《长城守望》", "以后能上4k就好了", "更啊，新dlc了", "DLC都出了什么时候更啊[星星眼]", "找到了", "[吃瓜]", "我玩英格兰的时候，还没冲3石墙都拉起来了，然后就是满级长弓硬守，唯一缺点就是顶不住重投，需要一堆重骑突一下。", "刚看到被隔壁日本暴打的视频，嘿嘿", "各位，萝卜已经一个月没更新了", "这场战役的胜利是农民修墙修出来的[doge]", "快更新视频呀", "生产队的驴都不敢这么歇阿", "月末萝卜会更新", "我想看DLC的教学 打不来", "催更！我的电子榨菜", "最主要农民能在墙上修墙", "论长城的重要性", "催更", "233", "帝国4 DLC催更", "土木堡中战神显，屯田门里“胜”葡夷\n日月山河永常在，歪脖树上存大明", "一位玩家在玩帝国时代游戏时,挑战中国文明的最高段位,与阿尔泰进行交战的过程。他介绍了中国文明特色的人口建筑和朝代规则,以及在游戏中如何利用侦察兵和圣物等策略来取得胜利。同时,他也分享了自己在游戏中的一些技巧和心得,如修建石墙和长城门楼等。整篇视频内容详实、有趣,对于喜欢玩游戏的读者来说,是一篇不错的教育内容。\n\n内容由AI自动总结, 总结内容仅供参考~ @推潭仆远之龙 触发了视频总结, 触发方式是 @有趣的程序员 总结一下", "AI课代表的笔记：这个视频介绍了帝国时代4游戏中中国文明的玩法。视频中展示了玩家在挑战最高段位时的游戏策略，包括开局的资源规划、建造村庄和地标、进入不同朝代的加成效果等。玩家通过巧妙的布局和战术，成功击败对手并推进进攻。视频中还展示了一些游戏中的特殊单位和科技，以及如何利用它们来取得胜利。 \n\n- 0:01 :Japanese_castle:中国文明的开局策略\n- 3:14 :dagger:战略决策和进攻手段\n- 6:27 :person_running:往北沿边缘跑的决策\n- 9:42 :bow_and_arrow:远程兵种对抗复杂组合\n- 12:56 :video_game:玩家的策略和战术\n- 16:12 :collision:战场上的故事\n\n本内容由大模型自动生成，关注并 @AI课代表呀 总结其它视频吧~（本条由 @推潭仆远之龙 召唤）", "中国文明能打败英格兰城市化的好比能打败黑萝卜城市化的只有波尔布特", "帝国4好难上手[辣眼睛]，四种资源加上没有满采设定，吃个肉还分羊果鹿猪田渔，整个人要疯了", "dlc更新了，赶快", "萝卜怎么不更新了，二十几天了[微笑]", "就等新视频了，想看萝卜玩日本[可爱小黄豆_wink]", "本萌新蹲几个萌新一起打人机", "今天18号了，新视频还是没出", "喂，zaima？", "萝卜，更正一下\n中国的海军特色科技“雷击炸弹”还没出现，这个科技可以给宝船装上一座蜂巢炮炮台", "在这明朝始建的城墙之下驰骋的元军领着宋朝的军饷重铸盛唐的荣光[脱单doge]", "李云龙表示  很赞[吃瓜]", "生产队的驴都不敢这么歇[脱单doge][脱单doge][脱单doge][脱单doge][脱单doge]", "我没文化，就一句话“CNM，太燃了”", "AEGIS 有没人懂？20多年了我还记得[滑稽]", "有一种隔壁COH里点了闪电战主义的国防和皇家工兵大英对冲的感觉\n水雷还是忘不了那个蹲坑大英[笑哭]", "《播放量不会超过两万》[doge]", "在贴吧知道了个奇葩的知识\n联通的盛唐武士，原型是＜满城尽带黄金甲＞里那帮子金甲步兵", "长城从来不是一个单纯的防御设施，而是一个集防御据点，通信传送，后勤补给，交通网络为一体的国防工程。", "人呢？", "星际云玩家问一下狗了会防是什么意思", "up主你不玩星际争霸2了啊！", "萝卜这个要怎么解决？", "公历11月15了。萝卜却依然没有更新下一集。", "UP是不是已经考上研了啊，yo~yo~", "中国真的很难玩，要玩到后面，要么队友法兰西早就蟒过去，要么早就打到你家门口了 根本没有机会搞，两个地标双份的资源，中国除了一个命官监督以外其他就没了，不如神罗", "这游戏可以玩种田吗? 可以只建造玩塔防吗", "纯萌新想入4请问得多长时间能入门，玩过文明6，不打pvp[来古-疑问]", "各位，帝国时代4打折了，标准版和豪华版的区别在哪里？我打算入。", "那先元后明就没有提速掷蛋兵了？", "厉害", "李云龙：把战壕挖到敌军阵地[doge]", "我有个问题，贪官哪去了[doge]", "省流:把墙伸进他嘴里", "萝卜不懂就问为什么我的f2总会框到农民啊[笑哭][笑哭]可以教教怎么改吗", "帝国四游戏建模很幼稚。。。但影片拍的真好！", "一把帝国4没玩过，看的津津有味，UP主确实很会做视频", "兄弟，你牛逼。", "大明还真有枪和手雷，可惜没钱置办啊，军饷都发不出来", "打过极难ai可以去打排位或者组排了吗", "你这也太城市化了", "已经开始期待过几天出新文明萝卜的活了", "还没看，但是我先点赞！！", "这把打的好看啊好激烈，而且体现了长城的效果", "澳宋政权（确信）", "我成年后的日子成年后的生活非常的幸福非常快乐非常性福非常舒服[响指]", "更！！！！", "结硬寨，打呆仗", "说起来萝卜后期为什么不用钟楼弩炮加大量蜂巢炮，然后火枪和关刀。只要钟楼弩炮可以打赢英国弩炮，蜂巢炮英国就没办法处理啊。而工程器不吃城堡网络，英国打不赢钟楼弩炮。", "你还是忘不了你的城市化是吧[doge]", "城市化的圣战！", "精彩绝伦", "好了好了，拖这么久，我入手帝4", "萝卜打的帝国时代很有意思。更新太慢了。谁知道还有没有相同玩帝国时代的大佬呀[OK]", "看up视频很带劲，自己玩就感觉没意思。", "6", "真正的鎏金玄武！", "保持更新", "太燃了。", "问一下，想入帝国4是去xbox还是steam买好？", "让我想起了一个叫攻城塔的兵种[doge]", "萝卜这把还是有提升的，英格兰大概率打城市化正面推，很少有骑兵穿家。萝卜可以用翰林院种田，这样中国的三狗官监督一狗官收税，金子收入也能追平英格兰的羊吃人。\n再加上圣物圣地和跑商的收入，部队以肉金为主抗住正面，两翼火长矛配合冲车进家，英格兰的城堡网络会陷入光有网络没有部队的尴尬境地。\n就是操作要求比较高，费手。\n英国因为武士质量高，长弓也是龟爬部队。所以火长矛只要不让农民安心种田，英格兰迟早肉金双亏。他只要敢回救，火长矛遛狗，然后正面吃战损就行。\n打着打着就以逸待劳，对面不攻自破。\n因为我朋友英国特攻，我擅长中国，以前被他打的压在二本起不来，特地针对研究中国对英格兰的战法。越是往后拖越容易赢。\n还有一种打法是换家，持续不断的凿穿对面城墙，保持火长矛压力，正面造大量建筑和防御假装大部队。然后等他想打一波的时候，利用皇宫特性，直接百余火长矛穿家。\n我7个地标，其中两个防御地标，还有一个可以到处野的灵道，农民修墙和大堡又快，怎么也不会换不过英格兰。", "1080为啥都这么糊阿", "赶紧更新啊", "星际呢……………", "真的精彩", "最喜欢看乌龟对咬了[doge]", "有没有大佬能帮帮忙的，好像自我换了个主板之后，启动帝国4，每次都是提示：“您当前为离线状态或尚未登录Steam，请重新连接以登陆游戏，注意：仅首次启动时需在线进行游戏”的报错，点重新链接也几乎是秒重复提示，开加速器也是一样，但其他游戏都正常，好痛苦[大哭]", "你以为萝卜要继续拉墙盖牌猥琐？哼哼，萝卜直接召唤门楼呈攻击状态！", "为什么我玩帝国时代4一直闪退，打完一次就闪退一次，输入法也删了，分辨率也调低了，虚拟内存也调高了，崩溃了\n或许注定我只能是个观众了[笑哭]", "伐伐伐木工，粮草征收员，何种命令，好", "萝卜多出点帝国时代4的视频，爱看爱看，每次吃饭都喜欢点开你的帝国时代4视频[脱单doge]", "我之前在srem里面打折买的文明3还是几忘了，然后我打开里面没有中国，反而有个日本的幕府时代的人物，果断退出，你一个标榜文明经营类游戏，里面没有中华文明，那还能叫文明？", "一人血书黑萝卜玩帝国酒馆", "帝国时代里混了星际2...", "开局：对方是个:turtle:\n最后：我把城墙修到对方家里", "最逆天是能在墙上修墙", "为了大明，我投币了", "话说，玩这种游戏很厉害的人成绩是不是也特别好？感觉脑子不灵活的人真玩不明白", "这把比赛打的·······\n感觉跟明朝平辽一样······\n守住山海关！我们有钱有粮！\n稳赢！", "生产队的驴都不敢这么歇着！！", "rts种族压制属于是了，无论是游戏还行现实[脱单doge]", "玄武本玄", "万里长城永不倒[笑哭][笑哭]", "我想问下，一般需要多少人口农民", "第一次刷到帝4的视频。我小时候玩的是帝国2，勾起回忆了。当时寒假拜年，去哥哥家里住，然后玩哥哥家的电脑，通宵玩帝国2，冻死我了[怪我咯]", "我感觉我打个战役都挺费劲的，没想到战役简直就是小儿科，pvp这么复杂高深的吗", "塔攻！6", "我的左翼正在撤退，我的右翼正在溃散，我的正面受到敌军的猛攻，现在形势好极了，我决定发起进攻", "对面为什么不修复伯克郡？没钱吗？", "精彩啊！", "6，什么联通版装甲掷弹兵，panzer是吧[笑哭]\n古德里安看了都表示英雄所见略同[哦呼]", "没玩过这个游戏的人问下 一句天梯多长时间啊  感觉很长", "从没玩过这游戏，啥设定都不知道，但不妨碍我看的津津有味。", "冲车＝跳帮鱼雷（）", "这个游戏有清朝没？", "不懂就问啊，为什么直接从宋朝跳到明朝了？虽然历史没学好，但唐宋元明清，我还是记得的[辣眼睛]", "精彩！", "恭喜萝卜破十万赞！", "给大家安利个rts手游，无序之地", "哈哈", "擅长堑壕战与冲锋，懂了 是克里格[脱单doge]", "虽然说没有如果，但是如果对面最后一波膀胱够好憋住了没有进攻把远程送掉，而且一点点蹭城墙会不会就打到大道磨灭了[笑哭]", "萝卜啥时候紧贴时事来一把嗨衣大食王朝[doge][doge][doge]", "对方不是脚本吧，这么感觉遇到城墙就走呢？", "114.5播放，喜", "不应该是先元后明么。。。", "21年出来的时候2本英格兰就城墙塞脸，城墙塔那时候点一下那个门就能上墙了不像现在需要造完，带给很多人快乐，不过后面人都会玩了段位高了就用不了了", "这招石墙推进我试了英格兰很好用放长弓弩手", "航空母墙[呲牙]", "先明再元：指打开电脑之后先把明日方舟maa挂上，然后打开原神[doge]", "这是哪天的直播", "打出了游戏王的效果", "这个把城墙插进嘴里的办法，玩战役时为了追求最低伤亡经常用~~~", "本来看的激情四射，直到我旁边的哥们来了一句“一只乌龟把头伸进了另一只乌龟的壳里”.......!", "我朝，元！[惊讶]", "质量最高的一集", "报！女王陛下！中国把长城修到唐宁街了！", "乌龟战争", "最强技术加持下的最勇猛的部队用着最强悍的后勤实现最伟大时代的复兴", "看了up好多视频，觉得真好看，帝国时代真好玩。但是一想到自己要入坑的话，RTS游戏，上手难度估计很大吧。各种文明各种兵种各种建筑，还有运营，还得多线操作。我玩魔兽争霸3一个简单电脑都单挑不过。。。", "这把是奇观胜利[doge]", "所以为什么对面后面不重新维修伯克郡宫殿呢？", "不愧是外国人的游戏，把中国文明搞得拉胯[捂脸]", "所以说联通是后期强，大后期不强？", "对面的ID是中文所以大概率是个中国人，他看萝卜的ID是英文，以为萝卜是个外国人，后面GG的时候用英文说明他找不到组合反推，所以到这，大家说对面的哥们会不会在想：我一个中国人用外国文明输给了一个外国人用的中国文明[doge]", "太棒了！", "黑萝卜请务必来个法兰西胜场，一桌子美味下饭菜里就这一盘是变质的[笑哭]", "用ExaGear玩的帝国时代2征服者\n挺高清的", "纠正一下  是朝廷狗官不是朝廷命官[doge]", "[思考]", "我和这个狼蛛打过，他的战法真的步步为营，我是典型的激突猛进，被他吊起来打", "这个版本有ai可以打吗？我小学玩过2[喜极而泣]", "我今天赢了一把奇观，对面把我家凿了个对穿，找不到。我把奇观造在了一个小岛上，那个岛小到我拉不了木墙。他怎么都没想到，在我家用两层城墙围住的是一个城堡[调皮]", "四呀，我还以为是三那", "精彩", "移动哨塔[脱单doge]", "6666666666666666666666666666666666666666666", "萝卜：你一拳打在我身上，我的肉体会痛，但是如果我在此刻放弃做人，成为一面拥有3900血的城墙，那你再打在我身上的后果只有一个！那就是双手断裂等待我将这幅坚硬的城墙塞进你的嘴里！[脱单doge]", "太妙了，驰骋的元军领着宋朝的军饷重铸盛唐的荣光[惊喜]", "那么在哪里能下载到呢？是不是很大", "可耻的修地堡[滑稽]", "好看，写作业不小心把老师写成“元朝的克里格骑兵了”", "太精彩了！", "这神马游戏？", "国内我们是瞧不上宋朝，但在欧美，他们一直觉得宋朝挺厉害的。\n因为在他们历史上，契丹、蒙古都是恶魔军团的级别。\n他们离恶魔上万里都被虐，但一个国家在隔壁反而撑了300多年，在他们眼里，算是奇迹了，这个国家还不强。[doge]", "我就说长城是用来进攻的嘛！还有b友不信[doge]", "萝卜萝卜说好的直播呢", "龟缩无敌十八摸", "太牛逼了 衝車步坦協同 長城壕溝戰 把世紀四打成一戰二戰", "想起了秦\n①骑兵战力上升\n②建墙赶快\n③酷刑增加农民速度或效率", "2v2来个城堡网+长城", "从某种角度讲这把属于奇观胜利", "两只王八在对顶[笑哭]", "女王殿下洋人打进来了[doge]", "昨天看得太投入忘记给币了[魔法学院_变猪]", "@后来她只是听说 @呆迷果", "省流 把长城修对面家里了", "我愿称之为长城网络[吃瓜]", "元朝的宝塔圣物是不是不吃修道院的全资源科技呀", "英：明之后的朝代，是那个可以很多钱还有很多地的吗？\n元：对:check_mark:你爹我回来了！", "好想看萝卜回我，教教我怎么提升多线操作能力目前钻三", "谁才是城堡网络[吃瓜]", "你的视频真的很燃！", "修长城让我想起红警的巨炮战术", "看简介《播放量不会超过2万》", "联通竟然能赢，还得削", "两年前我很喜欢用这个战术，28min憋帝王冲火长矛直线修墙上掷弹兵和弩手。可惜后来战术发展太快，绑定车队和开图炸房挂太多，逐渐afk了。", "多更新帝国时代呀，喜欢看", "技术好吗？号给你帮我上分", "精彩！", "要是萝卜把中国打全侦察马里的视频放出来对好！", "只有中国才能上墙吗？", "虽然没玩过这个游戏，但还是喜欢看[脱单doge]", "就因为宋朝狗的久，整个时代就叫宋代了，2333", "让你们见识一下奇观胜利万里长城[doge]", "666666666", "虽然不玩游戏（年纪大了，玩不动），但每次看萝卜视频都热血沸腾的。", "万里长城永不倒！", "万里长城万里长！", "语速为什么变了？？？？？", "明朝没亡的话，也不会有八国联军什么事了", "你这视频，至少要剪三天吧", "城市化[妙啊]", "这把我敢说基本就是中国文明设计的经典表现了。\n萝卜最后的掘进作业基本就是只有中国能玩的。\n长城伤害加成+火枪射程科技+中国高速修墙，才有这个效果。\n与阿巴斯（骆驼光环）、德里（大象）、马里（骑手光环）、神罗（脆皮双手剑）的特色兵种基本都需要编成混成部队不同，不论圣堂武士、诸葛弩、火长矛还是掷弹兵都是优劣非常突出且非常适合集群使用而不是混合使用的兵种，突出的就是一个灵活斗兽棋。\n就像中国的形容词一样：王朝、火药和税金。\n灵活的王朝单位，强大的火药单位，税金的经济优势以及独一无二的城市化能力。", "我透，长城从山海关修到伦敦，这得修多少年[doge]", "It&#39;s over England, we have the highground！", "就算不会玩帝国时代我也是每次看的津津有味的   更别说星际了哈哈哈哈", "精彩", "我懂了，这场是奇观胜利[doge]", "顶级文案", "看了这一期觉得帝国是真的好难玩[大哭]", "城墙骑脸", "太精彩了\n无论是从技战术角度（龟），还是场外的传承角度（唐宋元明没有清，好耶）\n都是我看萝卜视频以来的顶尖作品，打出了五常副本《长城守望》的感觉\n\n最后还是为历史感到遗憾，大明火器天下无敌，然后大清被八国联军降维打击", "攒和币我帮大家投过了，大家下一期帝国时代再投吧[脱单doge]", "打城市化还得看萝卜[大笑][大笑]精彩，但是看直播的小伙伴是不是在憋尿[大笑][大笑]", "斗王八也能燃是吧.[doge][doge]", "最后这个长城，真绝杀，7.5射程的中国火枪，还打不着你，太帅了", "长城修到你家门口[笑哭]", "你也想成为中华文明的一部分吗", "谁教你这么说话的", "这期无论对局精彩程度还是文案都堪称完美。\n佩服萝卜更新了这么久还能保持这么高的质量:thumbs_up_light_skin_tone:", "这一期好像诸葛弩没有出场（）唯一没出的王朝单位", "每视频一问萝卜什么时候出一期大海战", "每视频一问萝卜什么时候出一期大海战", "怀念9000血的城墙 乱杀金马的火矛骑 12格的钟楼炮", "为什么没有1000%了？就爱看这个[doge]", "刚出的时候打多人对战全是大炮对轰，谁炮多谁就赢，中国科技优越性一览无余。", "游戏一次没玩过，视频一次没落下[脱单doge]", "虽然看的很热血，\n但作为菜鸡44玩家，我看到其实这种大后期绞肉战其实挺慌的，因为这是现在联通最怕的场合。在失去了12射程手推炮和钟楼监督以后抢不到炮权的联通完全没有大后期绞肉的资本，对面要是奥斯曼罗斯阿拔斯之类那种出一大堆攻城器的话联通一点办法都没有。尤其是奥斯曼，巨炮同时兼顾了三种攻城器的特性，不出弩炮点不掉，出了弩炮正面没兵打不过，对现在的联通就是无解。\n所以有可能到这个场合时我就会考虑呼叫那些有跑商加成的队友准备奇观，准备不出就打GG。\n\n另外奥斯曼大后期推出亲兵大炮加金马的组合其实很有老联通的感觉，这也是罗马正统的一种表现（误）", "李云龙打山崎大队的战术，壕沟挖到脸上手榴弹招呼，这里是城墙修到脸上火枪手招呼", "简易反复观看后参加课堂小练[doge]（问：萝卜在第几分钟说出1000％？）", "太精彩了", "这期血战好精彩", "我哭死，最强科技的明朝率领着驰骋的元军拿着宋朝的粮饷恢复盛唐的荣光！", "很喜欢up主的视频风格能，可以做一些新手导向的视频吗[脱单doge][脱单doge][脱单doge][脱单doge][脱单doge][脱单doge]", "精彩精彩", "奇 观 胜 利", "精彩", "@黑羽辽_莲", "萝卜的三联一定要给啊！！！太优秀了！[给心心]", "吹大明在我眼里跟吹大清一个德行", "把长城塞进对面嘴里", "抢了4个圣物早点出宝塔更香", "哪怕是在老版本中国胜率垫底的时候，阿尔泰这张图中国的胜率都高的离谱", "最热血的一集.jpg", "帝国四刚出的时候我就用过修城墙把远程步兵站上去的空中隧道战术，没想到萝卜居然这期用了这招，好帅啊", "这期太精彩了", "这么看来帝国4的竞技性比2强很多了", "萌新想问 联通的改朝换代会覆盖上一个朝代的加成吗 比如进入宋朝的农民建造加速会在进入元明之后不见吗？ 谢谢[兔年]", "刚刷到：哟，这个up解说的挺有意思\n\n看了几个up视频：可以啊，开局的很多话都有伏笔\n\n深度看了几个up视频：我必须立刻马上入坑帝国时代4！\n\n入坑游戏：GG（你退出了游戏）。回来继续刷up的视频", "原始菌毯", "@背阳草--", "这一拳5000年的传承，大婴你接得住吗[滑稽]", "“奇观胜利”", "加油！！等你百大的一天", "投币的概率是1000%！", "精彩精彩", "我想问下已经放进自家修道院的圣物怎么拿出来，有时候想拿出来招降用", "明朝有能当手雷的炸弹吗？[哦呼]", "@苏格拉底的手中杯 看起来还挺好玩的[可爱小黄豆_哦哦哦]", "介个就是万里长城[脱单doge]", "拿明朝的响喂元朝的兵，萝大人英明[doge]", "欢迎收看 2k时期的史前帝拳大战原始铁勇珍贵录像[doge]", "右上角的电影场景模式让我有点出戏啊", "不错不错。全程解说挺激情。给三连", "好久没玩了，以前联通的抄家神器火长矛现在已经没用了吗", "看不明白，但是解说有点意思。三连支持一下[害羞]", "黑萝卜棒棒哒，动脑子玩游戏就对了，傻爆蟑螂什么的弱爆了~", "玄武大战", "在哪下载的？求网址[脸红][脸红]", "跟我打英国战役似的，把石墙修道对面脸上，再塞满长弓兵", "真正的长城守望", "堑壕战[打call]", "还好没变清朝啊[吃瓜]", "长城修到了脸上。[支持][支持]\n这种打法真的是非常有特点。", "标题《起伏》", "最后怎么有种，李云龙土工掘进干小日本山崎大队的赶脚。哈哈哈哈", "UP主不玩战锤全战么，喜欢那个游戏但还没有那个战锤up主像你这样对我胃口的视频风格的。能有时间研究下战锤就太好了。", "太精彩了，太精彩了！必须三连一下[打call]", "果然是地狱副本：长城守望", "我听到战意陌刀的招牌语音了", "解说的这么好，你要考研啊[脱单doge]", "新一代长城守望", "《播放量不超过2万》[脱单doge]", "共和国的指挥官使用驰骋着的元军领着宋朝的军饷重塑唐朝的荣光\n清：你礼貌吗\n民国：礼貌你马", "真是聪明，这局好看", "这期太好看了", "朱元璋：X\n朱宋璋：✓", "这一波精彩！！！太精彩！", "这游戏兵不能拆墙么，木墙感觉很好拆啊", "精彩，当两只乌龟相遇，用龟甲互磕的时候，比的就是谁的龟甲更硬", "其实也不能说不会通知对面，对面扫一眼胜利条件发现要拆的地标多了一个就能知道你上朝代了，只是不清楚是元还是明", "这样的战斗，所有人都上场了，除了诸葛弩[東雪蓮_气昏]", "这集太精彩啦！", "女王陛下，来自大明的那帮洋人打到泰晤士河啦", "对手：我实在不知道啥组合能推过去，GG", "笑死我了  长城修到他们家里了", "太熬人了[笑哭]", "看萝卜在帝国时代4手搓虫道网络（）", "帝国时代4要2K全高特效120帧率得啥笔电配置[鼓掌]有老哥说一下嘛，准备双十一了", "虽然不玩游戏，但是不妨碍我理解攻守交换的焦灼，真是太好看辣", "什么高维堑壕战，对面直接找不到破局办法道心破碎了=w=", "这波天才阿，我愣是没想到还能这么反攻回去", "明朝的兵享受着元朝的增益领着宋朝的军饷创造大唐的盛世，妙啊妙啊", "[笑哭]帝国原来玩起来那么热血的吗~！！！！！", "这就是完全的我(指中国", "怎么评价星穹铁道赞助中国星际争霸二战队", "《我猜大家一定不会看完 播放量也不会超过两万 》ヽ(￣д￣;)ノ", "一天7万赞？是我眼瞎吗？？", "太燃辣！", "还有吗。怎么没有清朝。", "多段操作协同 厉害厉害", "虽然没玩过，但是感觉好刺激[星星眼]", "两玄武内战", "[呲牙]好家伙居然看完了，这可太神奇了", "“只要把战壕再向前推进五十米，那剩下的五十米，就算是个娘们儿也能把手榴弹丢进去。”", "这局真的很不错！！！大部分战术策略都用上了，完美的展现了帝国4天朝的重点！", "精彩！", "掷弹兵大砍之前在多人局连着玩过一个月的直明掷弹兵，当时八十掷弹兵能炸穿三家主力。看萝卜玩掷弹兵有一点小tips，掷弹兵的阵型一定要选Z一字排开，这样接敌时会逐渐展开为成一个弧形，拍子一拍下去也不会出现死一片的情况。", "还是有点怀念当时给王朝单位打折的灵道   真的太猛了   话说那把火长矛猛拆罗斯为啥不做成视频[妙啊]", "本期视频MVP：长城门楼", "萝卜，上4的第一件事除去兵种升级外，十一税是一定要第一时间点的，况且你还是4圣物加持。这东西看着一分钟很少，但打起来那时间流逝过快，以至于发现去点十一税的时候都过了很久了，少了非常多的虚空资源（黄金）。另外联通4本之后最优解就是解锁火矛不断的多线去对面资源点洗澡，正面打关刀弩手城堡战，防火矛的压力和成本要远远高于火矛，而且很容易经济蹦，很吃守方资源的运营分配。一直到联通出得起足够的火枪，都是正面转部队直接配合手推蜂巢一波打死。  \n至少目前的联通4本 职业赛上基本都是这么打的。 多线的操作对于星际玩家不难，对于帝国的大多数玩家来说，难度是有的，毕竟这游戏运营更占优势，经常会忽略掉多线的操作，防多线的处理上也不够细。火矛的多线会让你联通提升一个档次，当然3本也可以这样搞。掷弹兵这个兵种，只能说出其不意有奇效。但真正统治战场的还得是高贵的射程:fire:枪", "UP有想法玩红警吗[doge]", "有没有可能。。以后清会出dlc。。。。", "出命官，监督萝北做视频", "好家伙。土工掘进打堑壕战。这战术咋看起来这么眼熟呢。。。。。", "省流：乌龟互顶", "少数能丢进收藏夹的视频", "萝卜终于更帝国时代了[脱单doge]", "女王陛下22年9月8号就无了", "帅炸啦！！！！！！！！[大哭][大哭][大哭][大哭]", "北京人说：地道儿，真地道儿", "卧槽，看的我想去把游戏下回来了", "狗了，会防[doge][doge]", "可以等15号绿色联通了", "这个游戏宗教游戏，圣物全拿到还能直接胜利[捂脸][捂脸]", "有没有要来新疆阿勒泰的人吗？阿尔泰就在上面边上，来看看这边的环境怎么样？[呲牙]", "萝卜，能运用阵法吗？", "对面最后的表情估计是，万万没想到啊！遇到一个骨质增生的乌龟", "可以追一下箱子里的大明，造赛博步枪明朝时期在起点网造手榴弹造蒸汽火车[奋斗]大战土匪", "[脱单doge]", "这把是真心血战了", "五常副本。长城守望！~", "这游戏是真给萝卜玩明白了，原始星际嘛[UPOWER_343348_音箱蟀侠]", "这一期太精彩啦", "看萝卜的运营真是一种享受", "Great wall rush[妙啊] 无论在哪，无论何时，萝卜都能将城市化发挥的淋漓尽致", "精彩，但是乌龟[doge]", "精彩", "唐朝按理说是最繁荣的，越升越烂啊", "奇观胜利：万里长城。[doge]", "更大原因是对面经济顶不住了吧，兵都补不上了", "中国战锤1k克里格死亡军队假说[doge]", "豬西的遺產", ":thinking_face:英格兰这个城堡网络，能不能通过部队掩护，不停的往前延伸城堡嘞？", "这把打的真精彩", "“而在这明朝始建的城墙之下驰骋的元军领着宋朝的军饷重铸盛唐的荣光”\n\n一句话直接看哭了", "精彩精彩", "萝卜现在不说as u can see了", "这么说不止可以唐宋明元，连唐明元宋也做得到咯！", "脑袋浮现朱元璋气到从棺材跳出来的景象[笑哭]", "想看一眼战斗结束时小地图上建筑的奇观。", "[doge]把长城修对面家里", "这期真的精彩，有种双方决斗者拼尽全力决斗的感觉了[脱单doge]", "多少米", "太精彩了！", "@-白鹿原- 买新电脑玩这个", "投币支持", "从水下萌芽的第一个生命开始……对不起，跑错片场了[笑哭]", "悲壮的长城守望副本[大哭]\n但是去你家里守望的[滑稽]", "长城vs伯克郡[笑哭]静坐战争是吧？", "省流:阿 尔 泰 森 林", "帝国版 Tower Rush", "罗布对中国文明的理解堪称大帝，朝代变换和女人变脸一样迅速，使草裙男猝不及防", "这次太精彩了 ，，，难得有人把联通的所有设定全打出来", "群众随将士一同上前线 \n中国军队扫除英军在中国土地上最后一座大型据点\n\n南京X报讯 10月28日，中国军队依靠人民修城墙战术，配合其他兵种，成功摧毁了英国在中国的最后一座基地，至此，中国全境再无英国部队。\n记者在前线了解到，为了充分发挥中国火枪兵的优势，中国政府积极发动人民群众，数万群众带着建筑材料，随着部队一起赶往前线。达到前线之后，部队冲锋杀敌作战，群众冒着枪林弹雨在徒手修城墙，一个人倒下了，第二个人就补上去，前赴后继，不怕牺牲。随着城门和城墙的修筑完毕，一队队火枪兵登上了城墙，利用城墙的高度和坚固的优势，向英军发动进攻。一声声枪响之后，英军阵地上留下了一片片尸体。而此时，群众也登上城墙为火枪队的士兵送水送饭。精力充沛的火枪兵发挥了超常水平，有一发子弹竟然无意间打掉了3里地外的骑在马上的英军军官，这一击致使英军军阵大乱，纷纷溃逃。\n截止记者发稿时的10月29日得到的消息，仅仅28日一天，牺牲在城墙修筑过程中的群众就多达百余人，火枪兵们看着牺牲的群众，纷纷留下了眼泪，发誓要打到英国去，为群众报仇。另据海外消息称，被击毙的英国军官名字是亨利·蒙哥马利，他其实是名牧师，而非军官，但他的死亡依然对英军造成了极大地恐慌。\n10月29日当天，此次战役的中国军队指挥官DarkCarrot接受了记者的采访，他告诉记者，虽然中国本土的战事已经接近尾声， 但英国在全球还有很多殖民地，罪恶滔天，很多殖民地里面的百姓们生活凄惨，民不聊生。为了解救受苦受难的百姓，中国军队将跨越海洋，剑指英国本土。当然，海外的作战指挥将交给某位爱吃菠萝和柚子的王子手中，到时候他将带领军队解放那些受苦受难的群众。\nDarkCarrot告诉记者，下一步，他将带领军队展开扫尾工作，彻底清除包括隐藏在深山老林中的英国残余军队，最大限度提升人民群众的幸福感、满足感，真正让人民群众远离战争，安居乐业。", "比拼谁是纯血玄武的对决", "这是从封建打到一战了啊", "没玩过帝国4，但这场对决是真的精彩。双方反复横跳，拉扯，前戏，高潮。把猥琐发挥到了极致。什么叫玩游戏？这就叫玩游戏。对游戏的理解，不从小白玩起来，一步步累积是玩不到这个水平的。帝国4各方面提升很给力啊，是不是只有中国的远程兵能上墙？终于见到远程兵能上墙了，之前类似的游戏，只有要塞系列能上墙。", "帝国时代特有的政治正确，帝国四唐宋元明艰难对抗英格兰，帝国三大清美洲暴揍欧洲列强", "老佛爷，东洋人的长城修到伦敦啦！", "啊？", "虽然不会玩，但是看的津津有味！", "真好康[喜欢]", "大明，京师三大营，这不呱呱乱杀", "明朝末日真的是没天时，没地利，没人和，想不出来怎么赢", "你在这跟我玩长城守望？[哦呼]", "我说怎么语气这么熟，低头一看“黑萝卜”，果然…", "给我投币！", "np", "半w人看，为啥帝四玩家那么多，匹配确比较久[笑哭]", "战术：唐-宋-明-元-秦", "这一局打的精彩~~~~", "这期英格兰够聪明了，科技特色拉满，基本城堡网格覆盖进攻/防守，好硬啊，家里还能刷黄金", "奇观胜利！", "其实英格兰后面已经没出弩车了，这个时候掏出蜂巢炮就赢了。弩车才是这个游戏最不合理的东西，轻松克制拍车手推炮和蜂巢炮，也就狙不到重投。如果说蜂巢炮是电兵的话那弩车就是狙击距离加强的鬼兵", "这游戏我听萝卜之前的视频说还有奇观胜利，那中国的奇观是什么？", "投两个币[脸红]", "这英格兰怎么完全不跑商，乌龟壳战术还是棋差一着", "是人机还是玩家[doge]", "什么时候帝国4能像2一样，文明一样多", "梦回魔兽三人族塔林时代。。。。", "突然想到火枪兵上城墙，那掷弹兵是不是也可以上城墙而且射程加2", "看见一段延伸到对面家的城墙，还在想怎么不赶快把远程单位都扶上墙[笑哭]", "好热血的战争！！！[脱单doge][脱单doge][脱单doge]", "不会玩的也从头看到尾，精彩。", "直肠是什么意思", "既然最近的视频都开始出现红警的元素了。那红警系列什么时候安排一下？[星星眼][星星眼][星星眼]", "啥，这都出4了？我还停留在3刚出那会[笑哭]", "这次的制作过程多出了10%的实力！", "手速和猪脑过载永远是我玩rts的痛", "只和朋友打AI的我竟然看完了，真给我看爽了", "不得不说两只乌龟的对局好看[保卫萝卜_白眼]，爱你哦", "你一定很喜欢水无月吧", "这下...你知道中国人为什么热衷修墙了吧？（战术后仰）[doge]", "萌新最近也在玩帝国4，有几个问题想请教一下：\n1：如何像war3一样显示队伍每个单位的血量？比如拉8人去打野猪，被打残的农民，有时候能难左键点到拉走，死了就感觉很2\n2：如何高亮显示鹿的尸体？玩罗斯前期去打鹿，后来准备抬鹿，结果鹿的尸体混在草地或者树林边根本找不着，转镜头找半天都看不到。还有就是抬鹿回家，如果7个侦查的话好像不能放到同一个地方，经常准备抬第二波鹿才发现自己抬得没放下\n3：编队有什么学问吗？按照以前RTS习惯，近战一队远程一队基本就够了，但是帝国可能还要一队攻城器，一队反攻程器，还可能带一队和尚，侦查也不知道编哪一队\n4：如何让部队分开攻击间隔？火枪或者火炮这些高伤害单位，控制不好经常伤害溢出。比如6火炮像shift对面火炮，直接shift感觉浪费不少输出，用阵型能控制码？\n谢谢了！", "想看海战", "这种四本大后期互相亮底牌连番血战看着是真的过瘾[tv_馋]", "然而我看完总结出一个真理，中国最牛逼的不是战斗单位，而是农民[妙啊]\n心灵手巧，勤劳勇敢，什么都会", "焯，又燃起来了", "666", "大哥哥啥时候做做帝国3的视频呀明明那么好的游戏qaq", "其实是因为对面没跑商，圈地已经被砍过了，后期没有黄金支持", "我笔记本刚加载完就闪退，台式玩大概半小时左右就己方单位无法移动，我真的要吐了[笑哭][笑哭][笑哭][笑哭][笑哭]", "最后对面说的啥？没找到comp，不然能推？", "原始网道技术（帝皇为你点了个赞）", "看的我热血沸腾，冷静下来之后发现是两只乌龟在互殴", "我一个不会玩的人都看的好爽[妙啊]", "长城确实是用来进攻的", "太精彩啦~", "[吃瓜]", "装甲运兵车很亮眼啊，没见过这招[OK][星星眼][星星眼]", "两只乌龟", "消磨资源的总体战、掷弹兵加堑壕战，带嘤看了很难不汗流浃背啊", "啥火枪站城墙？是高地堑壕战！[doge]", "这集关刀乘坐宝宝巴士突袭后排工程器，是我这种目光呆滞玩家怎么也想不到的。", "真的精彩，我要是英格兰输了一晚上都睡不着，同理萝卜输了也想一晚上[脱单doge]", "玄武大战龙龟233333", "出肉马也可以的 对面都是远程", "以前掷弹兵被削弱到没用 现在终于有点用了", "这个“抽车”的战术是真挺有意思的", "好家伙，两个现代人在中世纪游戏里打堑壕战", "看视频里好像中间打的时候掷弹兵都没什么控制的样子，我个人感觉掷弹兵这种单位还是编个队（或者部分一部分编队），然后有多余APM的话控制下炸的位置，发挥AOE优势比较好。\n很多时候G地板在人群中给一发会比自动攻击打最前排的人输出效果好得多。还有战线推进了，前排快走到远程脸上时，如果对方没来得及拉也可以乘机给他远程来一发。\n重投出多了也可以整些活，但好像没有人开发", "这期好燃，也好长[doge][doge][doge]", "很多人觉得钟楼只有一个，产能有限，但实际上联通钟楼混普通攻城器，弩车对狙环节还是得当做都是钟楼单位来处理，按照钟楼单位来算弩车的数量。\n你觉得这地上的弩车数量不对，怀疑混了普通弩车？那你敢赌吗，弩车队少编一个弩车，摸到了普通弩车算你赚，但没赌对打到了钟楼单位我就能留个残血，这发攻击就算白给了[doge]", "6", "？？？尼玛我凌晨三点多点开三千多人在看？", "香积寺之战既视感", "凌晨三点，3000+", "马后炮来说，先明再元还是有点抽象了，明朝10%血量感觉更适合阿尔泰这种狭窄的中线绞肉图推进战线/200人口决战。而且先明再元还卡了火长矛好久…", "英格兰最后出伯克俊基本说明已经没啥特别好的后期单位了 感觉往后大打弩炮战 之后关刀（投弹）弩炮蜂巢炮能赢的更早一些？", "太典了，诠释了三次元修长城的用处，防御建筑X，我把你家圈成我家！[脱单doge]", "书 接 上 回", "这属于是用英格兰的看家本领灭了英格兰了~2本长弓石墙RUSH", "@马了壁大", "没有aycs，差评[响指][doge]", "最后还是启动元神了", "太精彩了", "前几天自己玩的时候才发现能跳明反元，今天就看见了这么精彩的一集[给心心]", "精彩！", "精彩精彩！这期尤为精彩！[热词系列_三连]", "绞肉机", "长城骑脸，小子", "想到当年贴吧有个玩英格兰的大佬，就是修城墙配合长弓兵进攻，吧友戏称这个城墙是高速公路。没想到这个战术联通也能耍，还能耍出更多花样。", "太阳光了", "省流：人族内战", "所以中国真的不能出诸葛弩", "很精彩哦！", "总感觉up主总是不发展军事", "华厦菌毯", "这个游戏要真做大清会出啥[笑哭]清代除了火枪就是重步了吧，海军？", "明朝的军队领着宋朝的军饷重铸唐朝的荣光[支持]", "老李：你他娘的还真是个天才！[doge]够那老小子喝一壶的", "精彩", "清:我们5个真厉害[doge]", "结尾特意说了传承，那下一次就是dlc了[小电视_笑]", "推掉伯克郡以后，掷弹兵去推剩下的圣地占了会不会好一点，毕竟对面龟壳也是比较硬的[脱单doge]", "1：12…6000+人在看[笑哭][笑哭][笑哭]", "精彩！！！", "城门楼子现在改得那么炫酷了！我记得以前只有集体buff", "其实大明满科技关刀抗线不比英格兰铁罐头弱，关刀的血量计算是：（基础血量+身经百战）X大学精英步兵X大明血量加成=277血！英格兰罐头虽然多2甲，但是只有216血。", "更勤点！！！", "可以。帅的一批", "话说感觉联通是被削次数最多的国家了？好像什么单位都被削了一圈[仓鼠松鼠_问号]", "盲猜明天的直播间名称：视频昨天更新了！", "上热门了！好耶！", "功夫再高，也怕火枪[辣眼睛]", "跳朝代这个 没懂 就是最后是元 所以最后buff是移动速度？ 正常最后明是buff是血量 最后移动速度更重要？", "爱看，多更！！！", "精彩", "城墙=战壕，\n这个战术用修城墙（挖战壕）推进，李云龙是不是也这么干过", "精彩精彩，我买了一年多就过了个英格兰的剧情[doge]", "像极了一只龟被龟壳砸死了", "《装甲掷弹兵》", "[热]", "以前历史老师说长城不是用来防守的，是用来进攻的，我还不太信，今天看到有人实践，我意满离", "长城守望！", "17分钟左右有一条弹幕飘过去我觉得很对：“什么帝拳大战铁勇”[深空之眼 · 虚恒日常_吃瓜]", "奇迹胜利·万里长城", "太精彩了 这个长度看得很爽", "农民搭前进的道路\n火铳手保持前行\n让我想起了一个场景", "这真的是萝卜打的最精彩的一局了。\n虽然我不玩这游戏，但是看萝卜真的是看的津津有味，太有趣了。\n这个英格兰真的拉满是我觉得萝卜遇到的所有对手里最强的一个，在两个乌龟左右互搏的情况下能组织强大的反击和快速派出应对的单位，真的6。\n最后我要说一局，我爱你萝卜，我要和你击:male_sign:剑！", "懂了，帝国时代4是个塔防游戏。", "啊？", "虽然没玩过，虽然第一次看\n但依然很激情，三连了[热词系列_三连]", "怎么感觉标题看过", "实际上无论是抗弩箭还是抗火枪，都是关刀更厉害", "精彩", "还知道更新[呆]", "用现代战争的战术，指挥着封建时代的兵种，打着一战的堑壕战～精彩", "太精彩了", "长城门楼：很好的防守技能，但是是在对门家里防守[doge]", "这期真的希望大家看完质量真的好高吖 看的都有点感动了[热词系列_两面包夹芝士][热词系列_两面包夹芝士][热词系列_两面包夹芝士]", "原来万里长城是进攻用的啊，一直以为是防守建筑呢", "中国没投石么，云玩家", "up终于活了", "为什么说吃鹿肉快但是税金慢呢？吃鹿效率高我是知道，但是收税不是跟提交次数有关吗？不考虑手动提交的话研究手推车之前应该是10肉1金的固定比例吧。", "卧槽，长城骑脸[笑哭]", "这波啊，这波是把中国从秦到共和国的特点全融一起了[吃瓜]", "玩联通像这样混合兵种赢一把真的爽一天 联通的魅力被发挥的淋漓尽致", "哈哈哈哈，1v4电脑我就是靠修长城修到底才打得过电脑[笑哭]", "精彩", "这打的也太有创造性了[哦呼]", "目测今年最后一次用联通了，下次新视频用“朱熹之遗”[打call][打call][打call]", "中国各种元素和胜利方式都出过视频了，就差一个火长矛偷家翻盘的视频了[吃瓜]", "乌龟撞王八", "掷弹兵是个很神奇的单位，超长的科技线和前置价格使得这个东西不可能弱，但做的太强又不行", "乌龟对顶", "彩", "精彩！！！", "这一期太精彩了，几种战术的互相博弈，到经济运营策略的制定，每一项都环环相扣。美妙至极！[给心心][给心心][给心心]", "不仅有手榴弹，还站在墙上扔", "现在只想有个饭吃，全身还有两块[捂脸]自己刚来外地想吃顿好的都不行，身体从小有癫痫，恍惚间才记起来今天的生日，来外地两天还没找到工作，没有蛋糕，也没有亲人，骑车摔一身伤。有点给00后丢脸啦", "英格兰是真的能苟啊 这把五十分钟真憋尿", "先进的堑壕战", "只能说，星际2和日冕mod诚不欺我，我大明，天下无敌啊", "黑萝卜 恭喜你把我带入坑，打了十局死了九次不能说其他的 只能说未来可期", "用火长矛穿家螺丝直拆四个地标那集也要做成视频呀[打call][打call]", "精彩啊！[大笑]", "萝卜问一下怎么转移圣物啊？[笑哭]", "最后这波还就那个对人机特攻战术，人机很少拆墙，而大多战役需要防守，墙的效果又好，操作量不被拆墙确实也不大，最主要是打人机很容易资源量溢出。正常局势下石头还是太稀缺了，得留给城堡。", "牛逼牛逼，这局精彩", "唐朝扩张狂热:plus:宋朝经济后勤:plus:元朝军队组织:plus:明朝军事科技", "虽然是游戏，但是这很意淫", "把这个视频发给我历史老师看了他现在正在旁边慈祥的盯着我，诶不对历史老", "什么中门对堡[doge]", "1.4万人正在观看[脱单doge]", "装甲掷弹兵，火炮对射，互修要塞对峙，堑壕战，双方防线之间反复争夺绞肉。我懂了！这是一战(精神错乱)[妙啊]", "我记得如果士兵脚下的城墙被打碎的话，墙上士兵会立即死亡来着。。。", "有点疑惑 以前好像听说比赛不可以上墙 有这个说法吗 还是我搞错了", "来自大明的城墙上,有枪!", "巴 赫 穆 特 [脱单doge]", "日月所照之地 皆为汉土", "不得不比博燃了", "只能说把城墙修到别人家里，和挖堑壕到别人城墙下一个道理。", "卧槽热乎的", "萝卜是不是有点虚，感觉这期说话没劲[思考]", "这个英国似乎不知道武士那个看似毫无意义的篝火技能是反冲车神器啊", "萝卜，能不能点菜一把大明的宝船[脱单doge]", "哈哈哈哈笑死了对面说any ideas?总感觉意思是怎么个儿事呢", "大明，天下无敌啊", "终于更了[灵魂出窍]", "精彩", "菌毯骑脸", "打算玩这个游戏的萌新注意一下：联通是很强，但那是大后期，在除了征服者三之外的所有段位里联通胜率都是垫底的", "反清复秦是吧你小子", "李云龙：这集我熟，土木作业掘进干掉山崎大队[吃瓜]", "中国后期无敌，中国牛逼[doge][doge][doge]", "精彩！！！！！！！！！！！！！！！！！", "呵呵 五个小时已经27w了 好奶", "刚看了新宋，感觉就算有了新科学新技术还是很难做事。是不是因为没有一个统一先进的思想", "0:01", "没有AS YOU CAN SEE我是不会投币的[doge]", "城墙是有极限的，所以黑萝卜的选择是——突破极限！把城墙塞到对面嘴里", "中国人的万里长城岁被称为“中国历史上最伟大的军事防御工事”，可长城并不只是防御工事", "这期有没有原版录播[tv_doge]", "难怪我前天满地标最后是元朝，还以为是bug", "真就是长城守望？", "省流:互修bc", "太精彩了", "大明的手榴弹远远不如大元的手榴弹[doge]", "什么情况，我看的不是古代战争片吗，怎么一下子就到近代了，直接开始挖……不，应该是修战壕啦[吃瓜]", "省流：让欧洲人想起多瑙河边上的回忆[嗑瓜子]", "这期视频质量很高，狂喜[doge]", "一个月更新2次的up主的视频不舍得看，就像lu的最后一下想忍住一样。", "最后一首BGM是什么啊 全日语看不懂。。。", "卧槽，帝国4这么好玩啊", "感觉萝卜最好看的三个帝国视频就是大食打陈老师英格兰，奥斯曼隘口打罗斯和这把了", "太逆天乐，这战术真卧槽哈哈哈", "其实那一波英格兰要是有100农民种田就赢了", "懂了帝国四的终点是一战", "超级喜欢帝国时代！！！其他的感觉看不懂，UP可不可以把帝国时代4的视频搞个类似专辑啊，这样看完一期看下一期", "大明火器天下无敌[微笑]", "这把拉扯好精彩啊", "阿尔泰这张图中国优势太大了，昨天差点被一个黄金段中国乌龟:turtle:弄死", "云玩家，没看懂中国设定啊，两个地标自动进入下个朝代，那我先元再明和先明再元有什么区别吗，求教", "又不是我打，我憋着看完干嘛！！！卧槽", "打这么久的根本原因，还是这个游戏的英格兰太超模了。", "圣堂武士，亮出关刃", "RTS当乌龟的见过不少，乌龟顶乌龟也不是没见过，但一只乌龟把龟壳塞对面乌龟嘴里的倒真是少见。[doge]", "乌龟还是老的硬", "有空间的情况下联通修一小个口字形小碉堡在前线是不是比城堡要好？还能保攻城器，延申城墙", "号养成哩[脱单doge][脱单doge]", "从618年打到1917年（）", "缔造胜利的方程，那就是中国文明奇幻——长城！", "终于更新了[藏狐]", "从帝国开始关注up，全都很精彩！", "虽然是文艺复兴时期的战争，但双方的指挥官都突然领悟了三个世纪之后的一战的战术，我愿称之为“阿尔泰高地——阿尔泰绞肉机”", "钢铁勇士vs帝国之拳", "城市化并不是一种防守战术[tv_点赞]", "震惊！元朝军队命令宋人在大不列颠修建明长城！", "好好好，帅的不行", "想看你玩群星无mod25倍天灾最高难度，铁人模式", "突然有些理解我们一直玩梗的联合国五大副本里“长城守望”这个词条到底意味着什么了。\n\n这个“长城”指的不只是现实里的万里长城，更可能是这借由连绵不绝的文明与千姿百态的朝代所积累起的浩瀚文化，兵法，与技术传承。\n\n只要这个传承未断，拱卫文明存在的长城就会永远伫立下去。", "众所周知rts其实是回合制游戏[doge]", "嘎   那  塔!", "掷弹兵这个说法很西方啊这个叫投手会不会好点", "With a tow, row, row, row, row, row, to the Chinese Grenadiers~[脱单doge]", "你在帝国时代用一战战术？[辣眼睛]", "又是城市化，思路就没变过[笑哭][笑哭][笑哭]", "这期确实精彩", "又是堑壕战又是火骑兵，萝卜你克里格政委啊[哦呼]", "好家伙，我刚才刷到个被这萝卜打的视频", "敗因，被長城創死[嗑瓜子]", "总结下来就是，\n极限！犹可突破！\n至臻！亦不可止！", "为啥有种CN其实中后期也不强的感觉。。。。", "省流：凯拉克斯vs思旺，但是没有面板[doge]", "冲车塞兵这是真的可以，我之前神罗打蒙古，对面只有弩兵(对面的近战兵跟我换光了)，推到我家门口，我直接冲车塞满武士长矛走到对面脸上再f键下车，直接全歼[妙啊]", "最喜欢的一集！大后期的帝国观赏性真的很好", "我不管，新联通有二本关刀送命官开局，新联通肯定才是华夏正统老联通不过偏安一方的割据势力罢了[doge]", "拿出了1010%的制作水准！\n细节上明朝+10%", "不知道对手要过多久才能刷到这个视频鞭尸", "话说他这个火枪兵手上的手铳模型，明明是三眼铳，为什么没有近战能力呢？但凡去上网查查这个玩意儿有什么用，也不至于说火枪兵只能远程不能近战", "在这始建于明朝的城墙下，驰骋的元朝领着宋朝的军饷重铸盛唐的荣光我记得萝卜是在读理科博士吧，这文案水平，我看的up里面就一个老番茄水平这么高了啊", "这期让我想起来第一部宠物小精灵...两个铁甲蛹对着变硬...", "这把真的真的真的太精彩了！！", "唐完就送，送了就冥，冥了开原！", "我只能说 你是懂尤里的  什么钻地运输车？？[藏狐]", "对了，看萝卜是修了两个寺庙放圣物的，我记得联通不是有个特殊建筑宝塔吗？圣物到底放在哪个里面赚一点哇？", "两王八大战", "虽然看不懂，但感觉好精彩", "精彩", "学到了", "对面最后输得很憋屈。。。。。。", "标题笑翻了[doge]", "泉水钩打超市化", "说到神罗就不得不提到一个帖子了", "每天盼着黑萝卜更新[星星眼]", "虚假的基建狂魔：城堡网络哨塔抛矛\n完备的基建狂魔：攻守兼备物理围城", "英国真的强度太高了 操作要求低 后期强度又高 天天都被英国虐[辣眼睛]", "为啥一个帝国游戏被你们拉扯的那么有意思", "这集好精彩啊，对面也很强", "既然有典型环境中的典型人物\n那么就应该有唯心中的唯物圣物[doge]", "我玩英格兰也喜欢造城墙到别人家里", "乌龟的大胜利", "其实长城门楼可以两面一起建的。然后根据我改调整包的经验，掷弹兵的伤害不会被减免的原因是，伤害和护甲分为火伤，近战，远战和攻城，而游戏里单位的攻城护甲这一项基本都是0，而掷弹兵的伤害就是无敌的攻城伤害。", "或许可以下路分点兵拆了木墙去牵制注意力加找机会偷农民？", "之前萝卜的帝国视频只是看个热闹 这一期之后我是真想玩帝国4了", "墙临城下", "两小时，还算前排嘛[大哭][大哭]", "精    彩", "玄武对撅[笑哭]", "列祖列宗啊，你们看到了吗，朕把英格兰打败了呀:loudly_crying_face:朕把英格兰打败了呀:raised_fist::loudly_crying_face::raised_fist:大明，天下无敌啊:raised_fist::loudly_crying_face::raised_fist:（摇晃）", "这不比zvz好看一万倍", "精彩的对决，掷弹兵是被加强了吗？萝卜用了", "高质量", "萝卜视频养活了我三期视频特点作业分析了[脱单doge]", "6[妙啊]", "这都什么原始堑壕战啊[笑哭][笑哭][笑哭]", "可惜观众并不会陪萝卜一起考验膀胱，我们可以边上边看[doge]", "结硬寨打呆仗的天才", "我这就下一个去玩，就玩中国", "长城的正确用法[doge]", "新手入门教程", "唐—宋—明—元—一战[OK]", "长见识了，我的天[笑哭]最后这战术挠破头我都想不出来", "每次吃午饭都看，真的是电子榨菜", "什么时候出中国移动的视频[tv_doge]", "太精彩了", "城堡网络？\n长城守望！", "好比是端起碗就有饭", "这局太精彩了", "真 长城守望", "只想有个饭吃，全身上下还有两块[捂脸]自己刚来外地想吃顿好的都不行，身体从小有癫痫，恍惚才记起来今天的生日，来外地两天还没找到工作，没有蛋糕，也没有亲人，骑车摔一身伤。有点给00后丢脸啦。", "来了", "部队用土工作业的方式向前掘进，把战壕向前70米，剩下那30米，就是个娘们，也能把手榴弹扔进环形工事里去[脱单doge]", "6", "老公，你终于更新帝国四了", "萝卜真的就是宋朝前期打法，打呆仗一点点建设然后推过去，把你代入他的节奏，再用他丰富的经验把你打败[笑哭]", "很好的对手~", "四代的工程器沒有人推 每次看都覺得很怪", "这个带英其实还是不够黑暗，推进的时候不拉石墙是他最大的败笔", "凡尔登[doge]", "一点不膀胱，10小时ai漫画切片都能一次干完", "这把也太精彩了", "另外一种奇观胜利[脱单doge]", "太精彩了，真的", "太精彩了", "看标题想到了萨尔浒之战[doge]", "最热血的一集", "什么山阵号大战卡利班巨石[笑哭]", "第一次看到萝卜玩帝国玩得强度这么高的视频，这个我自问了，随便哪一方，换成我都已经打出GG了", "在看远古视频时，我被萝卜偷家了！", "萝卜有个错误，宝塔并不给石头", "感觉……怎么说呢？萝卜是不是有点累了？感觉没有了过去的激情。\n嗯，讲个故事吧。有一个人他想吃饭，于是他给自己做了饭，最后他发现自己做的饭不好吃，于是他就不停的练习，在这个途中有一些人问到了香味来吃他的饭，他就最给他们吃了，然而他最后的目标仍是为了给自己做一顿好吃的饭，当然随着他的口味不断的改变，也有不少的老客户不在光顾他家，但也有不少的新客户选择了他家，并且在这之后成为了老客户，当然最后他还是做出了自己喜欢吃的饭，而且还收获了一堆粉丝。", "这期质量好高", "好好好，多来点帝4", "这把看着热血", "彩！", "塔爆的至高境界墙爆", "这一叠叠的长城，就像一把利剑，直插不列颠尼亚的心脏。", "两个乌龟打架，最后因为其中一个乌龟把龟壳套在了另一个乌龟身上，那个乌龟赢了。[笑哭][笑哭]", "英格兰这个文明如果打的太保守，11到后期还是太乏力", "英格兰让联通安稳上三本的时候就已经输了，完全没有赢得点，经济兵种都比不过。", "菌……菌毯[以闪亮之名_哎？！][以闪亮之名_哎？！]", "这个土工掘进战术真是太经典了，当年土鳖靠着这招打赢了不少和国民党的战斗。", "既然出了龟壳就会失去优势\n那干脆把龟壳塞进对面嘴里！", "兄弟 你也太猛了吧 我都沒想到能這樣玩", "李云龙鬼子脸上修战壕，萝卜在英国人脸上修城墙", "很期待新dlc两个联通文明的肌肉碰撞", "这把英格兰圣物几乎都没拿到，也不知道跑商，按理说战术上已经很劣势了，却还能顶住萝卜这么久的进攻，可见英格兰的防御战有多硬。要是换了别的文明这样子，早在十分钟估计就要被一波了", "驰骋的元兵，使用大明的科技，领着大宋的军响，重铸盛唐的荣光[星星眼][星星眼]", "来啊，就是嗯啊，为什么更新这么慢？为什么不更新中国文明视频？现在我看来更新这么慢，原来是在打磨视频呐。", "我大概算了一下，整个视频长10K年，80%在进攻，不得不说对面人真硬啊[口罩][口罩][口罩]", "酣畅淋漓！[打call]", "最持久的一集！", "三连了", "精彩", "这一集可太精彩了。\n他们可喜欢明朝接下来的朝代，然后进入元朝\n这明朝始建的城墙之下，驰骋的元军领着宋朝的军饷重铸盛唐的荣光\n长城像矛一样修向对方阵地", "码的刚吃完饭，舍不得看了，明天再看吧", "视频把我看的好激动 我不怎么了解这个游戏 玩过一会儿因为脑子跟不上就删了", "我们先进的堑壕战终于取代了落后的静坐战", "对面打挺好，可惜初期没拿到虚空黄金导致转型什么的都变慢", "（观后感）如果说长城门楼是玄武的硬壳，火枪和石墙就是硬壳之上的蟒蛇！[打call]", "不过对面如果不把4本地标修脸上然后被端了，应该还能再苟下去吧", "真～长城守望", "看不了萝卜的帝国直播也就只能看看视频了，悲，不过我在想要是是掷弹兵上城墙，那不无敌？[神乐七奈_疑惑]", "直接投币，说到做到好吧", "打的跟巴赫穆特以及乌南大反击一样。但背后本质是原先红警时代，韩国转变投资策略，减少重工等资源投入对游戏进行产业扶持，郎有情妾有意各个主流游戏厂商对于该民族进行特种强化，而帝国四则是拿超模的兵种，先迎合一段时间国别的用户，然后再退潮，这样才让玩法多变体现在黑萝卜的游戏中", "构筑城垒～移动长城！[大会员粉豆人_色色]", "5000血的长城直接捅穿", "两只乌龟:turtle:哈哈哈", "一人血书求萝卜发一下那次蒙古救忽里勒台的那一集[大哭]", "掷弹兵-英雄单位", "两个龟龟！", "城市化内战", "中国长城超时空传送至苏格兰，打进英格兰本土[脱单doge]", "萝卜萝卜，11月份拜占庭就出来了，绿罗，神罗都出过视频了，不准备做个紫罗吗？[脱单doge][脱单doge][脱单doge]@DarkCarrot", "两只乌龟差点把地图给榨干", "为什么前几期没有看见萝卜出这个掷蛋兵？", "《堑壕战术运用于帝国时代的可行性分析》\n《论先进战术对战争结果的影响》\n《实例一则：城堡时代是怎样被火炮摧毁的》", "精彩", "火枪上城墙的那段，可以夹几个掷弹兵，5.5射程，还能吃亡语，那伤害嘎嘎乱杀。", "这期真的太精彩了", "太屌了", "朝廷命官:原始虫后\n村庄:原始达拉姆的荣耀\n烈日瓮城:原始我的建筑都比你有用\n天文钟楼:原始思旺重工厂\n皇宫卫兵:原始集结部队（划掉）太阳能战斧\n圣物:原始太空轨道瓦斯汲取器\n蜂巢炮:原始塔达林先锋\n弩炮:原始风暴战舰\n城堡:主矿要塞\n城墙:原始地堡", "最燃的一集[星星眼][星星眼]", "观看不超过2w(✘)\n发出来两个钟都还有1.2w+同时观看", "堑壕战，火箭炮，装甲车，掷弹兵，敌人是英gay兰，开始奋斗[脱单doge]", "第一次接触这游戏，我以为朝代加成能够继承[笑哭]，当时还觉得这尼玛后期不是无敌", "太精彩了，看完浑身冒汗", "好早", "哈马斯：你们的突击地道竟然建的这么高？", "萝卜萝卜。那个非洲侦察兵咋没做啊[脱单doge]", "中世纪堑壕[喜极而泣]", "精彩！", "看的太爽了这把", "精彩！", "两边是相同类型的替身呢", "精彩！", "这一期质量颇高啊，对面实力也很强", "自从发了动态一直等这个视频，万幸没有取关[滑稽]", "理解了老祖宗建筑的意义", "有北宋打西夏的味道了", "[doge]不懂就问为何不彻底变成乌龟，然后直接世界奇观？", "卧槽，历史上首次堑壕战。 拿破仑要有萝卜这战术思想还能输？", "鉴定为乌龟对顶！", "精彩！", "萝卜这个视频把这个游戏的策略玩法基本都用了一遍，精彩[tv_doge]", "虽然赢了，但感觉赢得很艰难，看起来还是英国更厉害", "好耶，是究极膀胱局[doge]", "这集看的我激动得直接吃了两只鸡", "视频七分钟两边上了帝王，而这时进度条甚至没到三分之一", "播放量不会超过两万的结论是怎么得出来的，你这个结论不严谨", "精彩绝伦！", "这把质量真高啊", "[吃瓜]看了几期视频以后就去买了游戏，但是玩起来没有看视频的快乐", "我的回合！通常召唤三星怪兽火枪！天文钟楼同调召唤蜂巢炮！然后用帝王时代进行调:star:！降临吧！喃无大慈大悲加特林菩萨！", "萝卜一个做游戏视频的文案怎么这么好啊", "精彩", "李云龙打山崎大队", "呆英的弓箭手能点燃箭矢 咱们不是有箭矢上绑炸药的玩法吗 咋没在游戏里提现啊", "拉满了", "把帝国时代玩成文明六，萝卜不愧是你", "万里长城是吧", "好耶，看完之前的视频一刷新就有新鲜的了", "两只龙龟在打架", "精彩！", "这把属实过于精彩，让我觉得这么多年的帝国4白打了", "本局你将看到原始机械化装甲掷弹兵，原始堑壕战[吃瓜]", "那么问题来了，掷弹兵能否上城墙呢，上了城墙之后又能否获得城墙的buff呢[藏狐]", "刚用二十发物理手雷砸死终极血肉之主就刷到这个 溜了", "运一车兵力我还以为会玩闪烁掷弹兵[哦呼]，这个虽然要点操作但是战损比挺离谱的", "2w播放量？200w！", "我感觉中国文明还是削弱了[doge]，大元可是一支骑兵杀穿亚欧大陆啊[doge]", "大英：我连光荣革命副本都还没开呢，这就给我来了个第一次世界大战？还TM面对的联通？", "一个想都没想过的战术……\n把长城修到对方脸上[笑哭][笑哭][笑哭]", "简介中的播放量不超过2万，还是太离谱了。\n因为我刚才看到的同时播放人数是1.8万（？？？）\n这么离谱吗？我还以为我看错了", "混几个手榴弹上墙也挺好玩", "还有一局明转元火矛换家罗斯呢，啥时候发上来", "6？", "别奶了，我爱死这期了，不愧是你，从小学开始玩帝国，十几年了，这期真的爽", "说好的膀胱局呢？12个小时都不到。太短了。", "笑死，你这个冲车的战术让我想起了帝国2冲车里面塞满了条顿武士的经典战术", "这把属于是把好几种平时比较罕见的战术演示了一遍", "这是袁崇焕五年复辽的城市化打法呀[吃瓜][吃瓜]", "时隔不知道多少天的更新，又是我最喜欢看的中国文明，我必须立刻点赞！", "[原子Dan莉莉装扮_赞赞赞]更了", "不得不说看萝卜玩中国文明就是一种享受[打call]", "不知道联通变体实际强度如何，很期待看萝卜打一期", "精彩", "百姓无不怀念我大萌", "两只乌龟，相当精彩，能狗能用得都造了", "打仗真是太恐怖了，要不是虚空资源，两个国家打一半的时候都只能吃土了", "前排，很火，很强大，萝卜哥哥辛苦", "精彩！", "精彩，这两枚硬币省不了了[打call][打call][吃瓜][吃瓜]", "太牛了吧", "女王已经薨了，现在是查理三世。", "真正的城堡网络：直接住城墙上[doge][doge][doge]", "这期真滴好精彩[罗小黑战记_棒棒][罗小黑战记_棒棒][罗小黑战记_棒棒]", "战役里的蒙古才是帝国4里集黑科技大成，只要交够石头，所有文明特性都给你弄来青春版，青春版重甲武士（比正常满科技再加3防3功），青春版皇家骑士，青春版长弓兵（额外3攻），青春版钟楼攻城器（除了额外科技加成还可以有蜂巢炮体验卡）", "这种打的有来有回的视频非常精彩。", "太精彩了，封建堑壕战~", "原始菌毯[笑哭]", "你这宋朝的军饷怎么都是纸，还一直贬值[喜极而泣]", "延伸长城（地台），是帝国之拳[妙啊]", "没有血量加成的武士，不配在掷弹兵面前叫嚣，神罗武士也不行", "真正意义上的长城[笑哭]", "[脱单doge][脱单doge][脱单doge]萝卜来练练", "帝④的确介绍过城墙的特殊效果，比如+射程和-受伤。\n联通补了一个+输出。\n但实际上确实很少人用，效果也是那句话，堑壕确实可以有效保护里面的单位，但也会造成内部的单位移动困难，加上城墙上最多只能有两排通过，实战中不是很好展开，而且由于聚堆效果，很容易被aoe打到，简单来说就是价格高，且需要操作且不够灵活。\n并且由于城墙会导致平射单位无法攻击，要是对面上了墙，或者在墙对面修防御，修墙的那个只能傻眼。", "片头呢？片头呢？片头呢？", "萝卜近两期帝国的强强对抗看的真是爽", "可算更新了QAQ", "没人注意黑萝卜从1000%变成1010%了吗[星星眼][星星眼]", "王八互咬[桃源_乖巧]", "众所周知，乌龟应该会吸引乌龟的，甚至可能还会认同性，所以\n清朝不敢打的人，我明朝打，明朝给不起的军饷，我宋朝给，宋朝没勇猛的军队，我元朝有，而以上所拥有的，我唐朝都有\n感觉突然了解，为什么开局是唐了？", "后期强度较高的联通打龟壳流英格兰都这么吃力，玩其他文明我压根不知道怎么破对面这阵地[笑哭]难道英格兰才是版本答案？", "最强技术加持下的最勇猛的部队用着最强悍的后勤实现最伟大时代的复兴——看到最后蹦出这句弹幕真的泪目~！", "投弹兵真的是我帝国四最喜欢的单位了，也是我理解中的中国的正面战场唯一一个能打的存在。特么其他特色兵种在一轮轮削弱之后真的是拉胯的不行。关刀正面真的是谁都打不过。弓手诸葛弩，骑兵火长毛，重步大关刀。面板数据真的是一个比一个拉跨。视频里面也能看出来，三防啊兄弟们。没有其他克制部队支援真的是头都给打爆了。\n但是投弹兵不一样，高贵的aoe。高贵的攻城伤害。散装拍子的存在啊。还是不怕弩车的散装拍子。关刀叉子混投弹兵。真的是正面战场的神。配合上中国射速加强版的手推炮点掉对面的拍拍。推进能力真的是不可阻挡\n当然，前提是活的到明朝（摊手）上帝已经很难。但上两次帝那可就真的是一言难尽了", "谢邀，我是这位修长城的村民[doge]，人已经在食堂吃白粥榨菜了[吃瓜]", "真行啊萝卜，把龟壳塞进对面嘴里[doge]", "女王陛下，来自东方的华人，有墙!", "这局太精彩了", "翰林院的选址怎么选啊，我看好多都是贴着TC下的，不会浪费很多地方吗", "告诉各位一个小知识：冲车不占用人口\n通常攻城器会占用3人口，但冲车不占用人口（这里有一个BUG，就是虽然冲车不占人口，但满人口建造不了冲车），自从上次更新加强了冲车之后这种原始莽兽就非常厚重，同时它们只取建筑为对象，敌方步兵很难同时阻拦十几辆不断移动的冲车，而它们高达50的远防几乎可以无效化一切远程攻击，如果对手只会A地板的话，那么冲车作为前排可以吸收大量输出。所以对面始终龟缩不出的情况下，可以试试冲车海。", "新鲜的！！！", "关刀也是双手武器，为什么不能和神罗一样+2攻[幻想乡的日常 第1弹_麻]", "这一期太精彩了，有双方的来回争夺，并且都使用了所以办法，[给心心][给心心][给心心]", "这和菌毯有什么区别？\n菌毯他不会咬人！", "堑壕战，但是在天上[脱单doge]", "还以为是刷漆赢", "这一集太精彩啦", "[妙啊]龟缩最终奥义  围墙修到对面家", "两只拿头发丝互戳的乌龟[doge]", "双方打得汗流浃背[doge]", "征服者的对攻打的真精彩，而我一个白金摩擦的鸡，正在被蒙古和直帝的神罗打的汗流浃背", "好看，爱看\n下饭神器[脱单doge][脱单doge]", "头一次见城市化比黑暗萝卜还龟的[喜极而泣]", "做大明的狗是尔等的荣幸[脱单doge]", "以全部的中国文明的力量，打爆他妈的整个英格兰呀！", "11:50的bgm是啥呀，提取不出来文字[大哭]", "这次真的是超级超级精彩！", "一次性伯克郡[微笑]，修哨塔也不去修伯克郡", "草……长城修到对面家里……", "感觉帝国四没有星际的那种焦灼和观赏性", "请问远程单位上石墙加成这么多，为什么实战很少见呢？比如萝卜保卫门楼的时候蜂巢炮就在下面被弩炮点掉了", "老天，我玩的时候怎么没想到还有这操作？直接就把石墙塞到他嘴里，这就是为什么我一直卡在黄金上不去的原因吗？[喜极而泣][喜极而泣]", "一个字，精彩[doge]", "精彩[星星眼]", "啊  这就是边跑商边开矿的高卢雄鸡嘛\n噢  对面竟然泰山压鹿\n额  反正现在英格兰也归德里管\n咦 怎么正好就是蒙古\n[笑哭]", "长城守望", "太精彩了！！！", "哦，原来是菌毯[笑哭]", "省流:先进的堑壕战", "这期视频质量高到爆炸，直呼过瘾", "明朝用宋朝的军饷，拥有元朝的仆从军和机动性。woc，无敌[滑稽]", "这游戏4K144需要什么配置？[脱单doge]", "谁能想到长城居然能成为进攻建筑呢[笑哭][笑哭]", "看来你悟了，恭喜恭喜[脱单doge]", "这把好精彩，有来有回，两军对垒，两只玄武硬碰硬(?)之后终于决胜负", "那一期火长毛翻盘罗斯地表胜利的", "精彩！我华夏5000年历史的厚重！", "帝国那把中国极限换家的萝卜打算做视频吗，感觉挺精彩的。地标多就是可以为所欲为[妙啊]", "不懂就问，奇观获胜应该怎么达成啊", "精彩！", "怎么看个视频都有RM佬啊", "错误的长城使用：偏安一隅，龟缩等死！ \n正确的长城使用：城墙骑脸，炮火轰鸣！[doge]", "草 这把 算是真百分之1000的水平吧，感觉打出了制作组做联通想要的效果，进入后期，灵活变化的朝代加成和王朝单位相互配合，丰富的资源底蕴，快速构建防御公事的能力。但是洋人想不到的是萝卜不但背负了四个朝代的厚重，还打出了近代轻步兵的战术，近迫作业！[doge]\n带英:不对劲，对面背后好像有五个人。", "这波是万里长城，驱逐鞑虏，振兴中华了", "看得出来对面这是真的被打服了", "好玩，这局就叫，真假黑萝卜，扳手腕[tv_doge]", "原始堑壕战[笑哭]", "十分好奇，现在在天梯里奇观胜利需要的资源很多吗？毕竟好像大多数都是暴兵和乌龟，或者是神罗和奥斯曼的圣地，很少见到用奇观胜利的局了。", "是时候掏出这个了", "请问一下，萝卜对朱熹的遗产怎么看？", "这把质量真高", "土工作业一直是中国人的灵魂", "虽然看起来很热闹！但是仔细一想，这TMD不就是两只乌龟！！！1V1差点把地图打干！", "1、冲车有装甲，可以防护小口径直射火力\n2、步兵在敌方阵地前沿下车\n3、冲车直接参与战斗，提供直射火力支援\n4、掷弹兵\n综上所述，这应该是明朝装甲掷弹兵部队，结合他们对圣地的偏爱，鉴定为“光明顶”师", "老佛爷，东洋人的城墙修到泰晤士河了！", "不懂就问，新文明分支来了以后，萝卜会不会出视频[doge]", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "我必须立刻开饭", "预测：女王陛下，大元的洋人不仅有手榴弹还有火箭炮！", "奥斯曼的堑壕推进是吧", "我收藏了这个视频，哪天儿子问我长城有什么用的时候，我就微笑着拿出这个视频，告诉他：“孩子，长城从来都不是用来防守的，那是我们祖先的究极进攻手段啊。”", "所以最后马厩也没去骚扰经济[doge]", "副本——长城守望是吧", "我去黑萝卜几乎每条都回复啊", "这:chicken:的质量不错哦，除了诸葛弩，基本能还手的单位都上了，最后的城墙更是神来之笔，在任何一个缝隙中都在提升战斗力[星星眼]", "66666", "伯克郡废墟看了20分钟戏[笑哭]要是对面出温佳德不知道战况会怎么样", "不好意思，先三连，后观看！", "我就说长城城墙是进攻利器[doge]", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "求问，黑萝卜的膀胱容量是多少", "等了那么久，原来憋了个大的", "萝卜的这次对局跟我最近的理解非常相似，但我只是个不打排位的noob，说错了还请见谅。  首先就是速城  中国在黑暗和封建实在是太弱了 面对重甲部队毫无办法 速城堡以后集结攻城器 以一定数量的蜂巢炮为核心 部队出叉+弩的反骑反重甲组合 但他们基本不具备单兵推进能力 唯一任务就是阻止对面骑兵与重步接近蜂巢炮 然后所有资源砸弩车 然后开始对狙 这把对面就是因为中期绝对的弩车数量优势阻止了优势兵力的萝卜 建筑和地标交给2~3座投石机慢慢推 同时集结资源上帝 第一时间点出弩车射程 把对面产能区推平 如果陷入僵局 出一队杂带诸葛弩的火枪直接沿着城墙推进 城墙火枪射程甚至能碰瓷长弓 组排时也同样好用 但可惜本人手残 虽然想法很美好但很多时候打不出来  操作大佬可以试试看可不可行", "非常好日月联通，爱来自元神启动（）", "这质量，我们中华文明的四大至高科技，足以赐予此视频百万播放量！[打call][打call][打call][打call]", "这游戏如果笔记本要玩要什么配置，还有这游戏多少钱", "发了视频怎么不直播啊", "两只铁乌龟缩着脑袋用尾巴互戳，枯燥的填线推线战打出华山论剑的效果。", "我相信你的裤裆里至少还有一张盖卡[doge]", "我直接开始吃饭", "这种战术在很久以前就有，不过是用来赖ai的[辣眼睛]", "三连了！快点继续更新吧！[脱单doge]", "两只乌龟对拼内力[大笑]", "太精彩了", "日月山河用在，大明江山永在！", "突然想起之前在萝卜联通打蒙古那期视频下问过掷弹兵有啥用，现在看到了，谢谢你，萝卜", "观众会暂停又或者带手机蹲坐在黄金马桶之上 而膀胱被考验的人只有你一个 黑萝卜", "讲真，我觉得明比元厉害多了，尤其在这种没法多线的图", "哇哦，up主还是爱我的[tv_doge][tv_doge][tv_doge][tv_doge]", "你听过苏格兰长墙么？在这个位面里，那是中国当年从家里一直修到英国的。", "地里捡黄金没能打败四台虚空印钞机。", "这个铺墙上墙感觉好霸道，虽然一直都有点优势，但这一手成功把优势转化成了胜势", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "什么时候出绝地火长矛烧家翻盘的那集，急急急急急急", "虚假的城堡网络，真正的城堡网络。", "只能说跟对面有点感同身受了，之前玩法兰西没注意被对面一个长城门楼塞到我商路边上了[tv_鬼脸]", "[兰音_吃瓜]", "有一说一，在萝卜拿到四个圣物和两个圣地已经赢了", "精彩精彩", "[小黄豆加减法_嘿嘿]", "看了这么多期视频 我终于在这一期觉得不三连不行了", "李云龙打山崎大队[喜极而泣]", "那我只能说罗马正统确实在中国", "虽然我看不懂，但是喜欢看[脱单doge]", "刺激、刺激", "精彩", "好好看", "棋逢对手，将遇良才", "对面打完这把，几天都不想玩帝国了", "大明的洋人不仅有枪有炮，甚至还会沃邦攻城法！[笑哭]", "把城墙一路造到对方家里的，多少有点把龟壳塞嘴里的感觉[笑哭]", "洋人不会以为长城是防御建筑吧[doge]", "怎么感觉是为了一点醋包了一笼饺子[笑哭]", "萝卜太牛逼！", "操作拉满", "不好评价\n作为一个老牌征三 这局后期能打这么精彩且合理是我完全没想到的 只能说萝卜总能整一些我眼前一黑的花活[笑哭]", "其实最早的手榴弹才超模[吃瓜]那时候150身板价格能打折基础价格也比现在低的多 而且那时候火工加成可以所有火药单位吃包括手推炮和手榴弹 那时候先明再元的话你就能获得一个1.3移速18aoe 5.5射程 130身板而且伤害类型是火药18对建筑+45的陆地低价万能单位[吃瓜]别人拿啥和你打都亏的一比除了石墙无法选取炸不了之外来啥都能给你炸了[吃瓜]但是如果墙上或者墙后面有单位的话一样能把石墙炸塌了（那时候40手榴弹就能强拆红宫了）", "长城果然是进攻手段[doge]", "帝国4的中国文明城墙还有个特性萝卜没说，就是附近有哨塔和防御塔会自动修复旁边的墙，不用村民修。所以说我玩中国文明就是“万里长城永不倒”", "这期确实好看，好精彩", "woc，地球上的史隆长城[doge]", "真的可以说是最精彩的一期", "日本和败占庭快出了，萝卜你懂得[doge]", "00:12", "精彩[脱单doge]", "好耶", "好家伙有来有回", "介游戏啥时候更新拜占庭阿", "塞里斯：在大明之后，我要再更新朝代系统。\n欧罗巴：我知道我知道！大清嘛，这个我喜欢！\n塞里斯：下面我们要进入的是：元朝！\n欧罗巴：？？？\n塞里斯：来人，准备铁骑和回回炮！\n欧罗巴：你不要过来啊！", "这个视频真的是最精彩的一期", "打得是真精彩，也好奇受害者是啥感受[doge][doge]", "军饷最满的一集[笑哭]", "万里长城，小子！", "把长城塞对面家门口是吧[doge]", "萝卜赶在饭点发，太懂我了[脱单doge]", "就好比刚吃完饭萝卜就把饭后甜点短上来了", "问个问题，马里二本为啥不选大金矿盖子？", "这期我愿称之为联通卖家秀[doge]", "这一期好精彩，各种特性都利用起来了，超越极限！", "明军掌握了先进的堑壕战理念", "好精彩的对局，战术的博弈太好看了", "开饭！", "两边都是在赛虚空资源啊，这一把可不可以算作虚空乱斗[doge]", "进元朝的时候建议BGM用张千一的追杀[tv_doge]", "这就是明朝末期在辽东的关宁防线，也就是努尔哈赤到死都没啃下来的地方[星星眼]\n大明！", "大明神机营的掷弹兵可太吓人了，只要多就能克制绝大部分单位", "回合制+TD+火枪=1000%[脱单doge]", "长城门楼的加攻效果在对面墙上也有效。[脱单doge]", "掷弹兵，火枪手干翻英格兰，什么师夷长技以制夷[doge]", "这次的中国文明介绍相当的全面啊", "爽[星星眼]", "纵观此局，双双马桶，二人幸终", "学会了今晚打一把就睡[脱单doge]", "好好好，我大明！天下无敌啊！！！", "复盘\n0，咖喱盖饭\n1，明（）？不能冲！不行！元（）！能冲！行！", "有理由怀疑对面是膀胱受不住了守不下去了[doge]", "精彩", "我们先进的掷弹兵，已经完全超越了老式的巨投！[tv_目瞪口呆]", "大明，天下无敌", "精彩 两个乌龟的互怼", "重生之我在大明挖堑壕[doge]", "这局看的太爽了，精彩！", "好帅啊", "所以这期是两只乌龟左右互搏是吧[笑哭]", "看完力，[脱单doge]对自己的逼视频自信一点", "太强了 中国所有战术都玩出来了[tv_点赞][tv_点赞]", "神机五千营！", "当我看到四本进度条才过一半我就知道事情不简单，最后这个门楼塞脸简直是神之一笔[鼓掌][鼓掌]", "便携移动大地堡", "好像对面是国人？有没有受害者现身说法", "我大明 天下无敌啊[doge]", "怎么还没2w播放？哦，是我来早了", "这期太精彩了", "好家伙，5000年历史的一拳", "宋朝的军饷明朝的军队强度，我大明满响！我大明天下无敌呀", "只要坚固的石墙继续推进，帝国的胜利就能不断延伸！[doge]", "联通使出明朝返元在AOE4里就像国际象棋里面使出王车易位一样，特殊而苛刻的要求带来的是一回合走两动的优势，而且这种优势还是建立在出其不意上，而非单纯因为数值而展示出的优劣。比如在火长矛版本，返元是一种常规手段，就是因为只要火长矛跑起来了，灵道带来的亡语与这种机动性强，对后勤施压大的兵种就已经可以使这个游戏变得无悬念。而如今的版本中，返元绝对是博弈中的一部分。", "这才是理解透彻的不可小觑的东方文明，投币了！", "播放量超过2万7了[打call]", "这期将中国文明的优势发挥到了极致，不亏是萝卜！[星星眼]", "堑壕战是吧", "这何尝不是另一种“长城门楼塞进嘴里”?", "这仗真打出一战的风格了，双方围绕着几个战略要地反复冲击，整张图都变成了凡尔登绞肉机。", "明军不满饷，满饷不可敌[doge]", "先进的堑壕战", "能把别人膀胱祸祸就已经很快乐了，如果还能赢那就是双倍的快乐[OK]", "可算更新了[OK]", "wc 元", "来的最早的一次", "长城，是长城冲过来了！[doge]", "刚刚上完厕所", "你说我的枪打的不准奈何不了你？那我把枪伸你嘴里呢？", "长城牛逼", "最好看的一集[不问天_prpr]", "把行星要塞拍到对面脸上[doge]", "漫长精彩的防守战[doge]", "省流，，城市化大战泉水钩（不是）[doge][doge][doge]", "阿尔泰？凡尔登！", "精彩！", "萝老师这两天直播输多胜少呀", "在战争中，大元领悟了来自一战的先进堑壕战：决战计划学说[doge]", "中原长城对狙[doge]让英格兰人像游牧一样载歌载舞", "萝卜感冒了吗？感觉有一点鼻音", "我联通天下无敌啊", "本来想晚上随便吃点泡面算了，一看到发视频直接起身穿衣服去食堂了[崩坏：星穹铁道_吃瓜ing]", "什么连续剧[滑稽]", "嗨嗨嗨", "这次掷弹兵真的是触地就炸的炸弹吗？", "这把真是史诗级城市化打战粪坑流", "明朝真的有掷弹兵这种东西吗[doge]", "提问，萝卜的比喻和小耗子可汗哪个更胜一筹", "这种互相乌龟的长久拉锯战可太有意思了", "唐 》宋 》 明 》元\n历史老师正在骑马赶来的路上", "萝卜萝卜，要不要试试红警的一个mod《红色警戒：星际争霸》简称《红色际霸》[热词系列_肥肠自信]", "在看完了萝卜的视频后突然感觉少了什么？是脑子吗？或者说是收获到了快乐^ω^", "怎么感觉萝卜这次视频有气无力的", "萝卜，我最近入坑星际了，能教教我怎么玩人族吗，感觉好难玩的说[以闪亮之名_哎？！][以闪亮之名_哎？！][以闪亮之名_哎？！]", "[热]萝卜饭点发太贴心了，可惜我已经吃完了[热]", "太阳光了，有种在中世纪玩堑壕战的美", "大明科技，天下第一！", "太阳光了，有一种探机修地堡电池的美", "2023年10月21日晚10点55，萝卜玩PVZ时最后一波在三路丢车的同时放下模仿者变了个海豚僵尸将duckparrot脑子吃了，警钟撅烂。", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "中国有一个朝代欧洲特别喜欢，每一个洋人都喜笑颜开，对，说的就是元。[doge]", "黑萝卜已经成为日常拖更博主了", "你搁这打现代战争呢，就地修战壕都出来了[辣眼睛]", "正好饭点，开饭[doge]", "烫萝卜！", "发现萝卜的id和鸟哥有一点相似，两边都喜欢时不时把id改成意义不明的单词，比如萝卜帝国4以前叫illusiveman，然后改成了normandy. 鸟哥美服id在我印象中有methusela, waitthewind, oldoliveira(这个还是很明显的), templar", "我想了想萝卜这是延毕还是读博了？", "饭店！肉人广快开饭！", "好好好，刚放学", "啊？掷弹兵原来是真伤啊", "帝国时代新手推荐玩啊", "想玩，坐等打折[doge]\n话说兄弟们还有没有其他有意思的帝国时代up主推荐一下[doge]", "[星星眼]", "话说掷弹兵在历史上是个什么定位", "萌新第一次k来这么早", "谁在呼叫长城[脱单doge]", "这么早？", "正好开饭", "视频更新辣！", "直播的时候看的从头笑到尾[笑哭]", "因为地标数量会显示在左上角\n封建3地标是宋\n帝王+5地标还是宋\n帝王+6地标就一定不是宋\n至于是哪个可以观察对方部队的属性\n\n其实也是能看的", "等了好久的掷弹兵，听萝卜直播讲了就心心念念，不过我更想知道萝卜那个打到金矿枯竭的局会不会做？[doge]", "什么索姆河", "等个朱熹的遗产", "我必须立刻开饭[脱单doge]", "这个视频的标题，我还以为是之前的视频。幸好我抱着既然上我首页，那我就重新看一遍的心情点看了，否则就不能第一时间吃饭了", "3000赞，好早", "唐升宋还有村庄吗？", "唯一放假的一天就赶上更新这是何等的幸福:smiling_face_with_hearts:", "萝卜，2:30那里怎么断片了？", "上一秒:这死萝卜还不更新\n下一秒:这香萝卜深得我心[脱单doge]", "为什么星际职业赛场上基本见不到战巡舰呢？", "狗了，会防！[打call]", "吃肉杀鹿有没有新鲜度？我记得帝国有设定是过了保质期肉就不能吃了来着？", "[妙啊]", "我猜下一集是，来自大明的洋人不仅有枪，手榴弹，还有机械飞升！［帝国时代4］", "(¦3【▓▓】", "这不得立即投币观看[吃瓜]", "@Kamisato_绫华 这个是你吗？我记得你有个号也叫狼蛛", "我大明天下无敌啊[妙啊]", "五分钟好耶", "还是热乎的[OK]", "萝卜萝卜 72在武汉 说要去找你玩", "[崩坏3·终焉归始_咀嚼]", "最早的一次！", "终于来了", "刚回到家就能看萝卜新视频[吃瓜]", "为什么这次多了10%的水准[脱单doge][脱单doge][脱单doge]", "五分钟，前面一万个人，大家吃完饭都看黑萝卜的吗？", ":smiling_face_with_heart-eyes::smiling_face_with_heart-eyes:", "热乎的[星星眼]", "讲个鬼故事，我看到萝卜的视频以后，立刻起身去拿耳机，手机静音播放，我看着字幕都能幻听萝卜的声音，离大谱。", "好好好！", "萝卜，求一下矿区群号！", "不会凉的，这么好的视频，怎么会凉呢", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "刚好军训完 我必须马上赶到食堂[OK]", "早", "好好好", "热乎（￣▽￣）", "视频发布了，那么距黑萝卜抵达直播间不超过20分钟", "等会我起猛了，怎么看见萝卜更新了？", "哦，我的天呐，我真的很想用我的蒙古铁蹄狠狠的捅英gei兰的屁股。[吃瓜][doge]", "热乎的", "三分钟。", "我必须马上吃...刚刚吃完.....", "来了", "语速比之前慢了", ":herb:", "热乎", "盛唐武士！集结！", "太贴心了。饭点发这个，我必须马上开饭！！！[doge][doge][doge]", "6666666", "之前是直播和视频双线协同，这次是视频空投骚扰给自己偷tc吃肉（指去食堂）打掩护是吧", "我必须重新集结晚饭[doge]", "我需要重新集结史官", "这还能有续集是吧[吃瓜]", "观众可不会和你一起考验[doge]", "好好好，最早的一次", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "第九十二", "晚了[doge]", "晚饭终于来了！", "快啊，很快啊。[doge]", "来了来了，两分钟", "woc1分钟就来迟了", "刚刚还在10刷巨疯捣蛋车[doge]", "第700人[打call]", "不是先抓羊回来再吃鹿么。感觉开局吃鹿容易卡肉需要提交啊。而且羊不拿就被对面拿了。血亏[doge]", "能不能更新勤一点。真想干死up主[原神_哼]", "刷过视频，等等，萝卜？", "[doge]", "热乎的", "热乎的我超", "真的我拿联通打罗马这种步战牛逼的就喜欢在诸葛弩中间混掷弹兵[doge][doge][doge]有奇效[doge]打重甲费劲，但是中间混的国土佣仆可受不住[doge]", "[喜欢]", "哦哦哦哦哦哦哦哦哦哦", "[doge]", "萝卜萝卜，你可以讲一下19号最后的火长矛换家的精彩故事吗[doge]", "好", "吾来也吾来也[doge]", "新鲜", "我超，热乎的", "女皇又要[doge]难受了", "我来早了？", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！[笑哭]", "刚刚！！！[doge]", "来了来了", "盲猜今晚萝卜直播间叫今 天 视 频 更 新 了[doge]", "热乎的", "这么热呼？", "新鲜的晚饭", "播放800，我前排的概率是百分之1000[doge]", "你的直播看不了啊，每次进去就是黑屏，啥原因啊", "新鲜的[星星眼]", "BV1u14y1t7eU\n续集[妙啊]", "热乎", "第一次到前排[打call]", "终于更新了[doge]", "热乎woc[星星眼]", "萝卜好猛[星星眼]", "萝卜凉了？不是我来早了[doge][doge][doge]头一次刚发就看到", "女王陛下被打服了[吃瓜]", "好好好[冥冥meichan_开车]", "[脱单doge]", "刚吃晚饭就有爷最爱的电子榨菜[喜欢]", "热乎）", "reh热乎的[打call]", "一分钟前边40个人，你们什么速度", "芜湖", "哇哦", "[星星眼]", "早[脱单doge][脱单doge][脱单doge][脱单doge][脱单doge]", "第八[doge]", "拔萝卜。", "第一？第一？", "热乎热乎", "0分钟芜湖", "来了", "终于更帝国了", "好好好", "新鲜的", "最先投币", "刚刚", "来了", "[星星眼][星星眼][星星眼][星星眼][星星眼]", "热乎的！", "蛮早的", "[脱单doge]", "来了来了", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "现在！", "来了[doge]", "来了", "更新啦", "报道", "来了", "第一", "来了", "666", "热乎[星星眼]", "？[doge]", "芜湖起飞", "来了[doge]", "《帝国时代4》的第20期视频！拿出了1010%的制作水准！这次打的和制作过程都可算真的是倾尽全力了！\n这是我从征服2冲征服3的天梯之一，对面征服者3英格兰，血战50分钟！\n然而帝王时代的战力顶点，并不一定能战胜全力运营的英格兰。但中国文明的特色就是连自己的极限都能超越！\n这盘中国文明的一切兵种和科技都有出场！毕竟是传承了四个朝代的至高力量！\n在等待合适的发布时间的过程中，我添加了很多音效细节，也提前修复了一些隐秘的字幕错误。\nBGM列表在最后，希望大家喜欢！\n视频比以往都长一些，我猜大家不会看完。播放量也不超过2万，先奶一口！", "我必须马上吃饭", "？？？", "[不问天_来了！]", "来了", "热乎的", "[NIYA表情包_点赞]", "[doge]", "来了来了", "来了", "第一", "来了来了", "第一", "好！", "第一？[doge]", "[doge]", "[星星眼]"]}